FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPDMA.c
/*-------------------------------------------------------------------------*
* File:  GPDMA.c
*-------------------------------------------------------------------------*
* Description:
*      HAL implementation of the LPC2478 GP DMA controller.
* Implementation:
*
*-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <stddef.h>

#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include <uEZRTOS.h>
#include <Source/Processor/NXP/LPC2478/LPC2478_GPDMA.h>

/*-------------------------------------------------------------------------*
* Defines:
*-------------------------------------------------------------------------*/
#define GPDMA_FLOW_CONTROL_DMA_CONTROLLER                 (0<<2)
#define GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER          (1<<2)
#define GPDMA_FLOW_CONTROL_SOURCE_IS_MEMORY               (0<<1)
#define GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL           (1<<1)
#define GPDMA_FLOW_CONTROL_DESTINATION_IS_MEMORY          (0<<0)
#define GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL      (1<<0)

#define GPDMA_CHANNEL0 0
#define GPDMA_CHANNEL1 1

/*---------------------------------------------------------------------------*
* Types:
*---------------------------------------------------------------------------*/
typedef struct {
    const HAL_GPDMA *iHAL;
    // Control word for DMA channel
    TUInt32 iControl; 

    // Configuration word for DMA channel
    TUInt32 iConfiguration;

    // source address
    TUInt32 iSource; 

    // destination address
    TUInt32 iDestination;
     
    // address of linked list
    TUInt32 iLinkedList; 

    // gpdma iChannel
    TUInt8 iChannel; 

    T_gpdmaPeripheral iSourcePeripheral;
    T_gpdmaPeripheral iDestinationPeripheral;

    // ISR hook function
    T_gpdmaCallback iISRCallback;
    void *iISRCallbackWorkspace;
} T_LPC2478_GPDMA_Workspace;


/*---------------------------------------------------------------------------*
* Forward declaration:
*---------------------------------------------------------------------------*/
static void LPC2478_GPDMA_Enable(void *aWorkspace);
/*static void LPC2478_GPDMA_Disable(void *aWorkspace);*/
static TBool LPC2478_GPDMA_ChannelIsEnabled(void *aWorkspace);
static void IGPDMAProcessInterrupt(T_LPC2478_GPDMA_Workspace *p);
IRQ_ROUTINE(IGPDMA);

/*---------------------------------------------------------------------------*
* Static global variables:
*---------------------------------------------------------------------------*/
// Number of G_opened dma channels.
static TUInt8 G_opened = 0;

static T_LPC2478_GPDMA_Workspace * G_workspaceGPDMAChannel0;
static T_LPC2478_GPDMA_Workspace * G_workspaceGPDMAChannel1;

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_InitializeWorkspace
*---------------------------------------------------------------------------*
* Description:
*      Setup the LPC2478 GPDMA iChannel 0 workspace.
* Inputs:
*      void *aW                    -- Particular GPDMA workspace
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
T_uezError LPC2478_GPDMA_InitializeWorkspace_Channel0(void *aWorkspace) {

    T_LPC2478_GPDMA_Workspace *p =
            (T_LPC2478_GPDMA_Workspace *) aWorkspace;

    // Setup GPDMA peripheral
    LPC2478_GPDMA_Enable(aWorkspace);

    // channel 0
    p->iChannel = GPDMA_CHANNEL0;

    // Fill the structure with default value for control and attributes.
    p->iControl = 0;
    p->iISRCallback = 0;
    p->iLinkedList = 0;
    p->iSource = 0;
    p->iDestination = 0;

    // Make local reference to the created workspace. Used in interrupt handler.
    G_workspaceGPDMAChannel0 = aWorkspace;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_InitializeWorkspace
*---------------------------------------------------------------------------*
* Description:
*      Setup the LPC2478 GPDMA iChannel 0 workspace.
* Inputs:
*      void *aW                    -- Particular GPDMA workspace
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
T_uezError LPC2478_GPDMA_InitializeWorkspace_Channel1(void *aWorkspace) {

    T_LPC2478_GPDMA_Workspace *p =
            (T_LPC2478_GPDMA_Workspace *) aWorkspace;

    // Setup GPDMA peripheral
    LPC2478_GPDMA_Enable(aWorkspace);

    // iChannel 1
    p->iChannel = GPDMA_CHANNEL1;

    // Fill the structure with default value for iControl and attributes.
    p->iControl = 0;
    p->iISRCallback = 0;
    p->iLinkedList = 0;
    p->iSource = 0;
    p->iDestination = 0;

    // Make local reference to the created workspace. Used in interrupt handler.
    G_workspaceGPDMAChannel1 = aWorkspace;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_Stop
*---------------------------------------------------------------------------*
* Description:
*      Disable GPDMA iChannel. Data is lost if is in DMA FIFO.
* Inputs:
*      void *aW                    -- Particular GPDMA workspace
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
T_uezError LPC2478_GPDMA_Stop(void *aWorkspace)
{

    T_LPC2478_GPDMA_Workspace *p =
                    (T_LPC2478_GPDMA_Workspace *) aWorkspace;

    switch (p->iChannel) {
        case GPDMA_CHANNEL0:
            // Disable iChannel.
            DMACC0Configuration = (0 << DMACC0Configuration_E_BIT);
            break;
        case GPDMA_CHANNEL1:
            // Disable iChannel.
            DMACC1Configuration = (0 << DMACC1Configuration_E_BIT);
            break;
        default:
            return UEZ_ERROR_ILLEGAL_PARAMETER;
    }

    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
        SSP0DMACR &= ~SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
        SSP0DMACR &= ~SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
        SSP1DMACR &= ~SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
        SSP1DMACR &= ~SSP1DMACR_RXDMAE_MASK;

