FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPDMA.c
    // Fill the structure with default value for iControl and attributes.
    p->iControl = 0;

    return UEZ_ERROR_NONE;


}

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_ChannelIsEnabled
*---------------------------------------------------------------------------*
* Description:
*      Check if GPDMA iChannel is enabled -> transfer in progress.
* Inputs:
*      void *aW                    -- Particular GPDMA workspace
* Outputs:
*      TBool                   -- Enabled ETrue else EFalse
*---------------------------------------------------------------------------*/
static TBool LPC2478_GPDMA_ChannelIsEnabled(void *aWorkspace)
{
    T_LPC2478_GPDMA_Workspace *p = (T_LPC2478_GPDMA_Workspace *) aWorkspace;

      // Enabled iChannel
     return (DMACEnbldChns & (1 << p->iChannel)) ? ETrue : EFalse;
}

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_Start
*---------------------------------------------------------------------------*
* Description:
*      Enable GPDMA iChannel -> begin new transfer.
* Inputs:
*      void *aW                    -- Particular GPDMA workspace
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
T_uezError LPC2478_GPDMA_Start(void *aWorkspace)
{
    TUInt32 regValue = 0;
    T_LPC2478_GPDMA_Workspace *p = (T_LPC2478_GPDMA_Workspace *) aWorkspace;

    // Test if we can enable the iChannel.
    if (p->iControl == 0 || ETrue == LPC2478_GPDMA_ChannelIsEnabled(aWorkspace))
        return UEZ_ERROR_NOT_READY;

    //Clear any pending interrupts on the iChannel
    DMACIntTCClear = 1 << p->iChannel;
    DMACIntErrClr = 1 << p->iChannel;

    // Memory to memory transfer;
    regValue |= ((0x0 & DMACC0Configuration_FlowCntrl_MASK)
            << DMACC0Configuration_FlowCntrl_BIT) | DMACC0Configuration_E;

    // If the callback is set, process interrupts.
    if(NULL != p->iISRCallback)
        regValue |= DMACC0Configuration_IE    | DMACC0Configuration_ITC;

    switch (p->iChannel) {
        case GPDMA_CHANNEL0:
        {
            // Source and destination address
            DMACC0SrcAddr = p->iSource;
            DMACC0DestAddr = p->iDestination;
    
            // linked list?
            DMACC0LLI = p->iLinkedList;
    
            // Write the iControl information into the DMACCxControl Register
            DMACC0Control = p->iControl;
    
            // Enable iChannel.
            DMACC0Configuration = p->iConfiguration;
//            DMACC0Configuration = regValue;
            break;
        }
        case GPDMA_CHANNEL1:
        {
            // Source and destination address
            DMACC1SrcAddr = p->iSource;
            DMACC1DestAddr = p->iDestination;
    
            // linked list?
            DMACC1LLI = p->iLinkedList;
    
            // Write the iControl information into the DMACCxControl Register
            DMACC1Control = p->iControl;
    
            // Enable iChannel.
            DMACC1Configuration = p->iConfiguration;
//            DMACC1Configuration = regValue;
            break;
        }
        default:
            return UEZ_ERROR_ILLEGAL_PARAMETER;
    }
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP0_TX)
        SSP0DMACR |= SSP0DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP0_RX)
        SSP0DMACR |= SSP0DMACR_RXDMAE_MASK;
    if (p->iDestinationPeripheral == GPDMA_PERIPHERAL_SSP1_TX)
        SSP1DMACR |= SSP1DMACR_TXDMAE_MASK;
    if (p->iSourcePeripheral == GPDMA_PERIPHERAL_SSP1_RX)
        SSP1DMACR |= SSP1DMACR_RXDMAE_MASK;

    return UEZ_ERROR_NONE;
}


/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_Enable
*---------------------------------------------------------------------------*
* Description:
*      Enable GPDMA controller and register interrupt handler.
* Inputs:
*      void *aW                    -- Particular GPDMA workspace
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
static void LPC2478_GPDMA_Enable(void *aWorkspace)
{
    (void)aWorkspace;

    // Increase number of G_opened channels.
    G_opened++;

    // Enable peripheral power
    PCONP |= PCONP_PCGPDMA;

    // Was registered already?
    if(EFalse == InterruptIsRegistered(INTERRUPT_CHANNEL_GP_DMA)) {
        // Enable interrupt.
        InterruptRegister(INTERRUPT_CHANNEL_GP_DMA, (TISRFPtr)IGPDMA, INTERRUPT_PRIORITY_NORMAL, "GPDMA");
        InterruptEnable(INTERRUPT_CHANNEL_GP_DMA);
    }

    // Enable GPDMA by writing ENABLE bit.
    // Always little-endian.
    DMACConfiguration = DMACConfiguration_E;
}

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_Disable
*---------------------------------------------------------------------------*
* Description:
*      Disable GPDMA controller and deregister interrupt handler.
* Inputs:
*      void *aW                    -- Particular GPDMA workspace
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
/* Not used currently
static void LPC2478_GPDMA_Disable(void *aWorkspace)
{
    (void)aWorkspace;

    // Decrease number of G_opened channels.
    G_opened--;

    if (0 == G_opened) {
        // Disable GPDMA by clearing ENABLE bit.
        DMACConfiguration = (0 << DMACConfiguration_E_BIT);
        // Disable interrupt
        InterruptDisable(INTERRUPT_CHANNEL_GP_DMA);
        InterruptUnregister(INTERRUPT_CHANNEL_GP_DMA);
    }
}
*/

#if 0
/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_PrepareMemToMem
*---------------------------------------------------------------------------*
* Description:
*      Set up GPDMA iChannel.
* Inputs:
*      void *aW                     -- Particular GPDMA workspace
*      T_gpdmaControl aControl                 -- Mode of operation
*      void *aSource                 -- Address of source
*      void *aDestination                 -- Address of destination
*      TUInt32 aNumTransferItems         -- Parameter is the number of data items, not the number of bytes.
*      void *aLinkedList                     -- Address of linked list
*      void (*aISRCallback)(TUInt32) -- Callback isr function
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
T_uezError LPC2478_GPDMA_PrepareMemToMem(
        void *aWorkspace,
        T_gpdmaControl aControl, 
        void *aSource, 
        void *aDestination,
        TUInt32 aNumTransferItems, 
        T_gpdmaLinkedList *aLinkedList,
        void (*aISRCallback)(TUInt32)) 
{
    TUInt32 control = 0;
    T_LPC2478_GPDMA_Workspace *p =
                (T_LPC2478_GPDMA_Workspace *) aWorkspace;

    // Load the destination & source address into the iControl block.
    p->iSource = (TUInt32)aSource;
    p->iDestination = (TUInt32)aDestination;

    // Load the iControl word.
    control = aControl;

    // Channel 0 and 1 have the same defines, so only iChannel 0 is used.

    // Set the transfer size and mode in the iControl word.
    control |=  (aNumTransferItems << DMACC0Control_TransferSize_BIT) & DMACC0Control_TransferSize_MASK;

