FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPDMA.c
    // DMA Scatter-Gather?
    p->iLinkedList = (TUInt32)aLinkedList;

    // Callback for DMA end or error?
    p->iISRCallback = aISRCallback;
    if (aISRCallback)
        control |= GPDMA_INT_ENABLE;

    // Bufferable and Cacheable. 0b110.
    control |= (0x6 << DMACC0Control_Prot_BIT) & DMACC0Control_Prot_MASK;

    // Store iControl value.
    p->iControl = control;

    // Memory to memory transfer only
    p->iConfiguration = ((0x0 & DMACC0Configuration_FlowCntrl_MASK)
            << DMACC0Configuration_FlowCntrl_BIT) | DMACC0Configuration_E;

    // If the callback is set, process interrupts.
    if (aISRCallback)
        p->iConfiguration |= DMACC0Configuration_IE | DMACC0Configuration_ITC;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_PrepareAnyToAny
*---------------------------------------------------------------------------*
* Description:
*      Set up GPDMA iChannel.
* Inputs:
*      void *aW                       -- Particular GPDMA workspace
*      T_gpdmaControl aControl                  -- Mode of operation
*      void *aSource                  -- Address of source
*      void *aDestination             -- Address of destination
*      TUInt32 aNumTransferItems      -- Parameter is the number of data items, not the number of bytes.
*      void *aLinkedList              -- Address of linked list
*      void (*aISRCallback)(TUInt32)  -- Callback isr function
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
T_uezError LPC2478_GPDMA_PrepareAnyToAny(
            void *aWorkspace,
            T_gpdmaControl aControl, 
            T_gpdmaPeripheral aSourcePeripheral,
            TUInt32 aSourceAddr, 
            T_gpdmaPeripheral aDestinationPeripheral,
            TUInt32 aDestinationAddr,
            T_gpdmaFlowControl aFlowControl,
            TUInt32 aNumTransferItems, 
            T_gpdmaLinkedList *aLinkedList,
            void (*aISRCallback)(T_gpdmaState))
{
    TUInt32 control;
    TUInt32 flow;

    T_LPC2478_GPDMA_Workspace *p =
                (T_LPC2478_GPDMA_Workspace *) aWorkspace;

    // Load the destination & source address into the iControl block.
    // (Note: These only apply to memory transfers)
    p->iSource = (TUInt32)aSourceAddr;
    p->iDestination = (TUInt32)aDestinationAddr;

    // Load the iControl word.
    control = aControl;

    // Channel 0 and 1 have the same defines, so only iChannel 0 is used.

    // Set the transfer size and mode in the iControl word.
    control |=  (aNumTransferItems << DMACC0Control_TransferSize_BIT) & DMACC0Control_TransferSize_MASK;

    // DMA Scatter-Gather?
    p->iLinkedList = (TUInt32)aLinkedList;

    // Callback for DMA end or error?
    p->iISRCallback = aISRCallback;
    if (aISRCallback)
        control |= GPDMA_INT_ENABLE;

    // Bufferable and Cacheable. 0b110.
    control |= (0x6 << DMACC0Control_Prot_BIT) & DMACC0Control_Prot_MASK;

    // Store iControl value.
    p->iControl = control;

    // Flow control is to be determined by the various types
    // General output to match Table 675 from UM102347: LPC2478 user's manual
    flow = 0;
    if (aSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL;
    if (aDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL;

    if (aFlowControl == GPDMA_FLOW_CONTROL_DMA) {
        flow |= GPDMA_FLOW_CONTROL_DMA_CONTROLLER;
    } else if (aFlowControl == GPDMA_FLOW_CONTROL_SOURCE_PERIPHERAL) {
        flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    } else if (aFlowControl == GPDMA_FLOW_CONTROL_DESTINATION_PERIPHERAL) {
        if (aSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
            flow = GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
        else
            flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    }

    // Setup flow control
    p->iConfiguration = ((flow << DMACC0Configuration_FlowCntrl_BIT) & DMACC0Configuration_FlowCntrl_MASK)
            | DMACC0Configuration_E;

    // If the callback is set, process interrupts.
    if (aISRCallback)
        p->iConfiguration |= DMACC0Configuration_IE | DMACC0Configuration_ITC;

    // If the source is a peripheral, configure the type
    if (aSourcePeripheral != GPDMA_PERIPHERAL_MEMORY) {
        p->iConfiguration |= 
            ((aSourcePeripheral << DMACC0Configuration_SrcPeripheral_BIT) 
                & DMACC0Configuration_SrcPeripheral_MASK);
    }

    // If the destination is a peripheral, configure the type
    if (aDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY) {
        p->iConfiguration |= 
            ((aDestinationPeripheral << DMACC0Configuration_DestPeripheral_BIT) 
                & DMACC0Configuration_DestPeripheral_MASK);
    }

    return UEZ_ERROR_NONE;
}
#endif

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_PrepareRequest
*---------------------------------------------------------------------------*
* Description:
*      Set up GPDMA iChannel.
* Inputs:
*      void *aW                       -- Particular GPDMA workspace
*      const T_gpdmaRequest *aRequest -- Request to prepare
*      T_gpdmaCallback aISRCallback   -- Routine to call when complete, or 0
*                                       for none.
*      void *aISRCallbackWorksspace   -- Pointer to data passed to callback
*                                         routine.
* Outputs:
*      T_uezError                  -- Error code
*---------------------------------------------------------------------------*/
T_uezError LPC2478_GPDMA_PrepareRequest(
            void *aWorkspace,
            const T_gpdmaRequest *aRequest,
            T_gpdmaCallback aISRCallback,
            void *aISRCallbackWorkspace)
{
    TUInt32 control;
    TUInt32 flow;

    T_LPC2478_GPDMA_Workspace *p =
                (T_LPC2478_GPDMA_Workspace *) aWorkspace;

    // Load the destination & source address into the iControl block.
    // (Note: These only apply to memory transfers)
    p->iSource = (TUInt32)aRequest->iSourceAddr;
    p->iDestination = (TUInt32)aRequest->iDestinationAddr;

    // Load the iControl word.
    control = aRequest->iControl;

    // Channel 0 and 1 have the same defines, so only iChannel 0 is used.

    // Set the transfer size and mode in the iControl word.
    control |=  (aRequest->iNumTransferItems << DMACC0Control_TransferSize_BIT) & DMACC0Control_TransferSize_MASK;

