FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_GPDMA.c
    // DMA Scatter-Gather?
    p->iLinkedList = (TUInt32)aRequest->iLinkedList;

    // Callback for DMA end or error?
    p->iISRCallback = aISRCallback;
    p->iISRCallbackWorkspace = aISRCallbackWorkspace;
    if (aISRCallback)
        control |= GPDMA_INT_ENABLE;

    // Bufferable and Cacheable. 0b110.
    control |= (0x6 << DMACC0Control_Prot_BIT) & DMACC0Control_Prot_MASK;

    // Store iControl value.
    p->iControl = control;

    // Flow control is to be determined by the various types
    // General output to match Table 675 from UM102347: LPC2478 user's manual
    flow = 0;
    p->iSourcePeripheral = aRequest->iSourcePeripheral;
    p->iDestinationPeripheral = aRequest->iDestinationPeripheral;

    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL;
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL;

    if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_DMA) {
        flow |= GPDMA_FLOW_CONTROL_DMA_CONTROLLER;
    } else if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_SOURCE_PERIPHERAL) {
        flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    } else if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_DESTINATION_PERIPHERAL) {
        if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
            flow = GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
        else
            flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    }

    // Setup flow control
    p->iConfiguration = ((flow << DMACC0Configuration_FlowCntrl_BIT) & DMACC0Configuration_FlowCntrl_MASK)
            | DMACC0Configuration_E;

    // If the callback is set, process interrupts.
    if (aISRCallback)
        p->iConfiguration |= DMACC0Configuration_IE | DMACC0Configuration_ITC;

    // If the source is a peripheral, configure the type
    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY) {
        p->iConfiguration |= 
            ((aRequest->iSourcePeripheral << DMACC0Configuration_SrcPeripheral_BIT) 
                & DMACC0Configuration_SrcPeripheral_MASK);
    }

    // If the destination is a peripheral, configure the type
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY) {
        p->iConfiguration |= 
            ((aRequest->iDestinationPeripheral << DMACC0Configuration_DestPeripheral_BIT) 
                & DMACC0Configuration_DestPeripheral_MASK);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
* Routine:  LPC2478_GPDMA_IsValidAddress
*---------------------------------------------------------------------------*
* Description:
*      Determine if the GPDMA is valid
* Inputs:
*      TUInt32 aAddr               -- Address to check if GPDMA works here
* Outputs:
*      TBool                       -- ETrue if valid, else EFalse
*---------------------------------------------------------------------------*/
static TBool LPC2478_GPDMA_IsValidAddress(TUInt32 aAddr)
{
    // The LPC2478 has 3 main regions where GPDMA can occur
    // USB/Ethernet memory          0x7FD00000 - 0x7FD03FFF  
    // Static Memory banks 0 - 3    0x80000000 - 0x83FFFFFF
    // Dynamic memory banks 0 - 3   0xA0000000 - 0xDFFFFFFF
    if ((aAddr >= 0x7FD00000) && (aAddr <= 0x7FD03FFF))
        return ETrue;
    if ((aAddr >= 0x80000000) && (aAddr <= 0x8EFFFFFF))
        return ETrue;
    if ((aAddr >= 0xA0000000) && (aAddr <= 0xDFFFFFFF))
        return ETrue;
    return EFalse;
}

/*---------------------------------------------------------------------------*
* Routine:  IGPDMAProcessInterrupt
*---------------------------------------------------------------------------*
* Description:
*      Generic routine for handling any of the dma channels (as passed
*      into the routine.
*      NOTE:  This routine is ALWAYS processed inside of a interrupt
*              service routine.
* Inputs:
*      T_LPC2478_GPDMA_Workspace *p      -- Port's definition to process interrupt
*---------------------------------------------------------------------------*/
static void IGPDMAProcessInterrupt(T_LPC2478_GPDMA_Workspace *p)
{
    T_gpdmaState state = GPDMA_UNKNOWN;

    // Check error state. Higher priority.
    if (DMACIntErrorStatus & (1 << p->iChannel)) {
        state = GPDMA_FAIL;
    } else if (DMACIntTCStatus & (1 << p->iChannel)) {
        // Completed.
        state = GPDMA_SUCCESS;
    }

    // Call the callback function.
    if (NULL != p->iISRCallback)
        p->iISRCallback(p->iISRCallbackWorkspace, state);

    // Clear possible interrupt sources.
    DMACIntTCClear = (1 << p->iChannel);
    DMACIntErrClr = (1 << p->iChannel);
}

/*---------------------------------------------------------------------------*
* Routine:  IGPDMA
*---------------------------------------------------------------------------*
* Description:
*      Capture the GPDMA interrupt and forward to IGPDMAProcessInterrupt.
*---------------------------------------------------------------------------*/
IRQ_ROUTINE(IGPDMA)
{
    IRQ_START();
    // Determine interrupt source.
    if (DMACIntStatus & (1 << GPDMA_CHANNEL0)) {
        //iChannel 0 - Enable callback
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel0);
    }
    if (DMACIntStatus & (1 << GPDMA_CHANNEL1)) {
        //iChannel 1
        IGPDMAProcessInterrupt(G_workspaceGPDMAChannel1);
    }
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC2478_GPDMA0_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA0",
            (T_halInterface *)&LPC2478_GPDMA_Channel0_Interface, 0, 0);
}

void LPC2478_GPDMA1_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("GPDMA1",
            (T_halInterface *)&LPC2478_GPDMA_Channel1_Interface, 0, 0);
}

/*---------------------------------------------------------------------------*
 * Interfaces:
 *---------------------------------------------------------------------------*/
const HAL_GPDMA LPC2478_GPDMA_Channel0_Interface = {
    {
        "GPDMA:LPC2478:CH0", 
        0x0100,
        LPC2478_GPDMA_InitializeWorkspace_Channel0,
        sizeof(T_LPC2478_GPDMA_Workspace), 
    },
//    LPC2478_GPDMA_PrepareMemToMem,
//    LPC2478_GPDMA_PrepareAnyToAny,
    LPC2478_GPDMA_PrepareRequest,
    LPC2478_GPDMA_Start,
    LPC2478_GPDMA_Stop,
    LPC2478_GPDMA_IsValidAddress,
};

const HAL_GPDMA LPC2478_GPDMA_Channel1_Interface = { 
    { 
        "GPDMA:LPC2478:CH1", 
        0x0100,
        LPC2478_GPDMA_InitializeWorkspace_Channel1,
        sizeof(T_LPC2478_GPDMA_Workspace), 
    }, 
//    LPC2478_GPDMA_PrepareMemToMem,
//    LPC2478_GPDMA_PrepareAnyToAny,
    LPC2478_GPDMA_PrepareRequest,
    LPC2478_GPDMA_Start,
    LPC2478_GPDMA_Stop, 
    LPC2478_GPDMA_IsValidAddress,
};


/*-------------------------------------------------------------------------*
* End of File:  GPDMA.c
*-------------------------------------------------------------------------*/
